app/views/blogs/_blogs.html.erb

            <div class="post-block-content">
              <% if blog.blog_attachments.count > 0 %>
---
SELECT COUNT(*) FROM `blog_attachments` WHERE `blog_attachments`.`blog_id` = 44423