app/views/blogs/_comments.html.erb

INSERT INTO `comments` (`body`, `user_id`, `commentable_id`, `commentable_type`, `created_at`, `updated_at`) VALUES ('1111', 14, 44423, 'Blog', '2016-05-02 04:20:34.750021', '2016-05-02 04:20:34.750021')
---
          <div class="feed-user-block-item-title">
            <div class="feed-user-block-item-title-wrapp"><span><%= link_to comment.user.nickname, user_path(comment.user.nickname.downcase) %></span> пишет <%= time_ago_in_words(comment.created_at, :highest_measures => 1) %> назад.  <% if current_user && comment.user == current_user %><b><%= link_to 'Удалить', blog_comment_path(blog, comment), method: :delete, remote: true %></b><% end %></div>