app/controllers/admin/badges_controller.rb

  def index
    @badges = Badge.all
---
SELECT `badges`.* FROM `badges`

  def create
    @badge = Badge.create(badge_params)
---
INSERT INTO `badges` (`name`, `slug`, `desc`, `created_at`, `updated_at`) VALUES ('Комментатор Бронза', 'comments-bronze', 'Награда дается для первый оставленный коментарий', '2016-05-02 03:53:36.956234', '2016-05-02 03:53:36.956234')

  def edit
    @badge = Badge.find(params[:id])
---
SELECT  `badges`.* FROM `badges` WHERE `badges`.`id` = 1 LIMIT 1

  def update
    @badge = Badge.find(params[:id])
    @badge.update(badge_params)
---
SELECT  `badges`.* FROM `badges` WHERE `badges`.`id` = 1 LIMIT 1
UPDATE `badges` SET `name` = 'Комментатор1', `updated_at` = '2016-05-02 03:42:29.162148' WHERE `badges`.`id` = 1

  def destroy
    @badge = Badge.find(params[:id])
    @badge.destroy!
---
SELECT  `badges`.* FROM `badges` WHERE `badges`.`id` = 1 LIMIT 1
DELETE FROM `badges` WHERE `badges`.`id` = 1