app/controllers/admin/mass_spam_controller.rb

  def create
    if params[:users][:category] == 'all'
      # шлем всем
      User.where.not(id: current_user.id).each { |user| user.send_message(params[:message]) }
    elsif params[:users][:category] == 'writer'
      #шлем писателям
      User.where.not(id: current_user.id).where(writer: true).each { |user| user.send_message(params[:message]) }
    elsif params[:users][:category] == 'user'
      #шлем конкретным юзерам
      User.where(id:params[:user_ids]).each do |user|
        if current_user.dialogs.includes(:users).where(users: {id: user.id}).exists?
          dialog = current_user.dialogs.includes(:users).where(users: {id: user.id}).first
          dialog.messages.create(body: params[:message], user: current_user)
---
SELECT `users`.* FROM `users`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  1 AS one FROM `dialogs` LEFT OUTER JOIN `dialogs_users` `dialogs_users_dialogs_join` ON `dialogs_users_dialogs_join`.`dialog_id` = `dialogs`.`id` LEFT OUTER JOIN `users` ON `users`.`id` = `dialogs_users_dialogs_join`.`user_id` INNER JOIN `dialogs_users` ON `dialogs`.`id` = `dialogs_users`.`dialog_id` WHERE `dialogs_users`.`user_id` = 14 AND `users`.`id` = 15 LIMIT 1
SELECT  DISTINCT `dialogs`.`id` FROM `dialogs` LEFT OUTER JOIN `dialogs_users` `dialogs_users_dialogs_join` ON `dialogs_users_dialogs_join`.`dialog_id` = `dialogs`.`id` LEFT OUTER JOIN `users` ON `users`.`id` = `dialogs_users_dialogs_join`.`user_id` INNER JOIN `dialogs_users` ON `dialogs`.`id` = `dialogs_users`.`dialog_id` WHERE `dialogs_users`.`user_id` = 14 AND `users`.`id` = 14  ORDER BY `dialogs`.`id` ASC LIMIT 1
INSERT INTO `dialogs` (`created_at`, `updated_at`) VALUES ('2016-04-27 07:44:47.649640', '2016-04-27 07:44:47.649640')
INSERT INTO `messages` (`body`, `user_id`, `dialog_id`, `created_at`, `updated_at`) VALUES ('', 14, 4, '2016-04-27 07:46:10.722821', '2016-04-27 07:46:10.722821')