app/views/breeds/index_dogs.html.slim

          div class="photo-day-stick"
            span = breed.mypets.count
---
SELECT COUNT(*) FROM `mypets` WHERE `mypets`.`breed_id` = 1