app/views/breeds/show.html.slim

SELECT `mypets`.* FROM `mypets` WHERE `mypets`.`breed_id` = 1
---
    ul class="vote-list"
      - @breed.mypets.each do |pet|