app/views/users/_edit_form.html.erb

        </label>
        <% if @user.country.nil? %>
---
SELECT `countries`.* FROM `countries`

                <p>Город</p>
                <%= f.select :city_id, options_for_select(@cities.collect { |city| [city.name.titleize, city.id] }, @user.city_id), {}, { id: 'cities_select' } %>
---
SELECT `cities`.* FROM `cities` WHERE (country_id = 1)