app/views/users/_info_profile.html.slim

  = link_to "Отправить сообщение", dialogs_show_path(user.nickname.downcase), class: "send-massege"
  - if current_user && user.subscribers.where(subscribable_type: 'User', subscribable_id: user.id, user: current_user).present?
---
SELECT `subscribers`.* FROM `subscribers` WHERE `subscribers`.`subscribable_id` = 15 AND `subscribers`.`subscribable_type` = 'User' AND `subscribers`.`subscribable_type` = 'User' AND `subscribers`.`subscribable_id` = 15 AND `subscribers`.`user_id` = 14