app/views/users/show.html.slim

SELECT COUNT(*) FROM `mypets` WHERE `mypets`.`user_id` = 14
---
      = render partial: 'info_profile', object: @user, as: 'user'
    - if @user.mypets.count == 0

SELECT COUNT(*) FROM `blog_attachments` WHERE `blog_attachments`.`blog_id` = 44417
SELECT  `blog_attachments`.* FROM `blog_attachments` WHERE `blog_attachments`.`blog_id` = 44412 LIMIT 3
---
          = " ..." if blog.body.size > 320
        - if blog.blog_attachments.count > 0
          p
            - blog.blog_attachments.limit(3).each do |attach|