app/views/home/_general.html.slim

    li
      = link_to (image_tag pet.pet_attachments.first.file.thumb_70), user_path(pet.user.nickname.downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14  ORDER BY `users`.`id` ASC LIMIT 1