app/views/home/_no_pet_day.html.slim

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
      span   = pet.breed.name
    span class="owner" #{pet.user.first_name if pet.user.first_name}  #{pet.user.last_name if pet.user.last_name}