app/views/home/index.html.slim

      li
        = link_to (image_tag pet.pet_attachments.first.file.thumb_174), user_path(pet.user.nickname.downcase) if pet.pet_attachments
---
SELECT  `users`.* FROM `users`  ORDER BY repa_total DESC LIMIT 10