app/views/dialogs/index.html.erb

							<% unless dialog.messages.empty? %>
                            <% user = dialog.users.where.not(id: current_user.id).first %>
---
SELECT  `users`.* FROM `users` INNER JOIN `dialogs_users` ON `users`.`id` = `dialogs_users`.`user_id` WHERE `dialogs_users`.`dialog_id` = 2 AND (`users`.`id` != 1)  ORDER BY `users`.`id` ASC LIMIT 1

								</div>
                                <% if dialog.messages.where("user_id != ?", current_user.id).where(state: "new").count > 0 %>
---
SELECT COUNT(*) FROM `messages` WHERE `messages`.`dialog_id` = 2 AND (user_id != 1) AND `messages`.`state` = 'new'