app/views/dialogs/show.html.erb

SELECT COUNT(*) FROM `messages` WHERE `messages`.`dialog_id` = 3
SELECT `messages`.* FROM `messages` WHERE `messages`.`dialog_id` = 3
---
						<ul class="dialogue-list">
                            <% if @dialog.messages.count > 0 %>

SELECT  `users`.* FROM `users` INNER JOIN `dialogs_users` ON `users`.`id` = `dialogs_users`.`user_id` WHERE `dialogs_users`.`dialog_id` = 4 AND (`users`.`id` != 14)  ORDER BY `users`.`id` ASC LIMIT 1
---
							<% @dialogs.each do |dialog| %>
							<% user = dialog.users.where.not(id: current_user.id).first %>

SELECT COUNT(*) FROM `messages` WHERE `messages`.`dialog_id` = 4 AND (user_id != 14) AND `messages`.`state` = 'new'
---
								</div>
                              <% if dialog.messages.where("user_id != ?", current_user.id).where(state: "new").count > 0 %>