app/views/admin/mass_spam/index.html.slim

  p
    - User.where.not(id: current_user.id).where(bot:false).each do |user|
---
SELECT `users`.* FROM `users` WHERE (`users`.`user` != 14) AND `users`.`bot` = 0