app/controllers/blogs_controller.rb

SELECT  `blogs`.* FROM `blogs` WHERE (created_at < '2016-05-03 15:42:05.575955') AND `blogs`.`del` = 0  ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def index
    @blogs = Blog.where("created_at < ?", Time.now).where(del: false).order('created_at DESC').page(params[:page]).per(10)

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`user_id` = 1  ORDER BY created_at desc LIMIT 1
SELECT COUNT(*) FROM `blogs` WHERE `blogs`.`user_id` = 1
INSERT INTO `blogs` (`title`, `body`, `created_at`, `user_id`, `updated_at`) VALUES ('2222222', '<p>222222</p>', '2016-04-20 12:17:23.330868', 1, '2016-04-20 12:17:23.332774')
UPDATE `blogs` SET `title` = '2222222', `body` = '<p>222222</p>', `created_at` = '2016-04-20 12:17:23.330868', `user_id` = 1, `updated_at` = '2016-04-20 12:17:23.332774', `id` = 44420, `body_size` = 6 WHERE `blogs`.`id` = 44420
UPDATE `users` SET `repa` = 281.5, `updated_at` = '2016-04-20 12:17:23.348820' WHERE `users`.`id` = 1
SELECT COUNT(*) FROM `blog_attachments` WHERE `blog_attachments`.`blog_id` = 44420
INSERT INTO `subscribers` (`user_id`, `subscribable_id`, `subscribable_type`, `created_at`, `updated_at`) VALUES (1, 44420, 'Blog', '2016-04-20 12:17:23.410916', '2016-04-20 12:17:23.410916')
UPDATE `subscribers` INNER JOIN `users` ON `users`.`id` = `subscribers`.`user_id` SET users.my_feed_count = users.my_feed_count + 1 WHERE `subscribers`.`subscribable_id` = 1 AND `subscribers`.`subscribable_type` = 'User'
---
  def create
    #Установка created_at для писателей
    if current_user.writer
      if current_user.blogs.count > 0
        if Time.now - current_user.blogs.order("created_at desc").first.created_at > 3.days
          time = Time.now
        else
          time = current_user.blogs.order("created_at desc").first.created_at + Random.rand(48..120).hours
        end
      else
        time = Time.now
      end
    else
      time = Time.now
    end

    @blog = current_user.blogs.build(blog_params.merge(created_at: time))
    if @blog.save
      # создание картинок, если они есть
      if params[:attach_ids].present?
        BlogAttachment.where(id: params[:attach_ids]).update_all(blog_id: @blog.id, user_id: current_user.id)
        @blog.update(blog_attachments_count: @blog.blog_attachments.count)
      end
      increment = 20 + (@blog.blog_attachments.count*2)
      @blog.user.increment!(:repa, increment)

      # Создание подписки на этот блог для автора
      @blog.subscribers.create(user: current_user)

      # Увеличение my_feed_count для подписчиков
      current_user.subscribers.joins(:user).update_all("users.my_feed_count = users.my_feed_count + 1")

INSERT INTO `rewards` (`user_id`, `created_at`, `updated_at`) VALUES (14, '2016-05-02 05:55:27.679393', '2016-05-02 05:55:27.679393')
SELECT  `badges`.* FROM `badges` WHERE `badges`.`slug` = 'blogger-bronze' LIMIT 1
SELECT `rewards`.* FROM `rewards` WHERE `rewards`.`user_id` = 14 AND `rewards`.`badge_id` IS NULL
---
      # проверка для создания награды для юзера
      current_user.blogs.reload
      if current_user.blogs.count >= 500
        current_user.rewards.create(badge: Badge.find_by_slug('blogger-platinum')) unless current_user.rewards.where(badge: Badge.find_by_slug('blogger-platinum')).present?

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 44420 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    if @blog = Blog.find_by_id(params[:id])
      if browser.known?
        @blog.notices.where(user: current_user).delete_all if current_user
        # инкремент views для блога
        #@blog.increment!(:views, 1)
        # создание награды для автора @blog за views
        if @blog.views >= 10000
          @blog.user.rewards.create(badge: Badge.find_by_slug('blog-views-platinum')) unless @blog.user.rewards.where(badge: Badge.find_by_slug('blog-views-platinum')).present?