app/controllers/blogs_controller.rb

  def show
    begin
      @blog = Blog.find(params[:id])
      @comments = @blog.comments
      @comment = Comment.new
      @blog.notices.where(user: current_user).update_all(new:false) if current_user
---
SELECT `notices`.* FROM `notices` WHERE `notices`.`user_id` = 1 AND `notices`.`new` = 1
UPDATE `blogs` SET `views` = 1, `updated_at` = '2016-05-02 09:12:58.687704' WHERE `blogs`.`id` = 44423