app/controllers/breeds_controller.rb

SELECT  `breeds`.* FROM `breeds` WHERE `breeds`.`translate` = 'sharpei' LIMIT 1
---
  def show
    unless @breed = Breed.find_by_translate(params[:translate])

SELECT `breeds`.* FROM `breeds` WHERE (breed_type = 'dog')
---
  def index_dogs
    @breeds_dog = Breed.where("breed_type = ?", "dog")