app/controllers/comments_controller.rb

INSERT INTO `comments` (`body`, `user_id`, `commentable_id`, `commentable_type`, `created_at`, `updated_at`) VALUES ('1111', 14, 44423, 'Blog', '2016-05-02 04:20:34.750021', '2016-05-02 04:20:34.750021')
UPDATE `users` SET `repa` = 23.0, `updated_at` = '2016-05-02 04:20:34.761104' WHERE `users`.`id` = 14
SELECT COUNT(*) FROM `comments` WHERE `comments`.`user_id` = 14
SELECT `comments`.* FROM `comments` WHERE `comments`.`user_id` = 14
INSERT INTO `rewards` (`badge_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 14, '2016-05-02 05:47:08.166199', '2016-05-02 05:47:08.166199')
SELECT  `badges`.* FROM `badges` WHERE `badges`.`slug` = 'comments-bronze' LIMIT 1
SELECT `rewards`.* FROM `rewards` WHERE `rewards`.`user_id` = 14 AND `rewards`.`badge_id` = 1
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 44423 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14  ORDER BY `users`.`id` ASC LIMIT 1
---
  def create
    # создаем коммент для комментируемого объекта
    @comment = @commentable.comments.create(comments_params.merge(user: current_user))
    # увеличиваем репу для юзера
    @comment.user.increment!(:repa, 3)
    # проверка кол-ва комментов у юзера и выдача награды
    current_user.comments.reload
    if current_user.comments.count >= 15000
      current_user.rewards.create(badge: Badge.find_by_slug('comments-platinum')) unless current_user.rewards.where(badge: Badge.find_by_slug('comments-platinum')).present?
    elsif current_user.comments.count >= 1000
      current_user.rewards.create(badge: Badge.find_by_slug('comments-gold')) unless current_user.rewards.where(badge: Badge.find_by_slug('comments-gold')).present?
    elsif current_user.comments.count >= 50
      current_user.rewards.create(badge: Badge.find_by_slug('comments-silver')) unless current_user.rewards.where(badge: Badge.find_by_slug('comments-silver')).present?
    elsif current_user.comments.count >= 1
      current_user.rewards.create(badge: Badge.find_by_slug('comments-bronze')) unless current_user.rewards.where(badge: Badge.find_by_slug('comments-bronze')).present?
    end
    # проверка кол-ва комментов у блога и выдача награды для хозяина блога
    if @commentable.class.name == 'Blog'
      if @commentable.comments.count >= 200
        @commentable.user.rewards.create(badge: Badge.find_by_slug('blog-comments-platinum')) unless current_user.rewards.where(badge: Badge.find_by_slug('blog-comments-platinum')).present?