app/controllers/dialogs_controller.rb

  def show
    @user = User.find_by_nickname(params[:nickname])
    @dialogs = current_user.dialogs.includes(:messages).order("messages.created_at desc")

    if @user.nil? || current_user == @user
      redirect_to dialogs_path
    elsif current_user.dialogs.includes(:users).where(users: {id: @user.id}).exists?
      @dialog = current_user.dialogs.includes(:users).where(users: {id: @user.id}).first
      @message = Message.new
      if @dialog.messages.where(user: @user).count > 0
---
SELECT  `users`.* FROM `users` WHERE `users`.`nickname` = 'fdfdfdfd' LIMIT 1
SELECT  DISTINCT `dialogs`.`id` FROM `dialogs` LEFT OUTER JOIN `dialogs_users` `dialogs_users_dialogs_join` ON `dialogs_users_dialogs_join`.`dialog_id` = `dialogs`.`id` LEFT OUTER JOIN `users` ON `users`.`id` = `dialogs_users_dialogs_join`.`user_id` INNER JOIN `dialogs_users` ON `dialogs`.`id` = `dialogs_users`.`dialog_id` WHERE `dialogs_users`.`user_id` = 14 AND `users`.`id` = 15  ORDER BY `dialogs`.`id` ASC LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`dialog_id` = 3
SELECT  1 AS one FROM `dialogs` LEFT OUTER JOIN `dialogs_users` `dialogs_users_dialogs_join` ON `dialogs_users_dialogs_join`.`dialog_id` = `dialogs`.`id` LEFT OUTER JOIN `users` ON `users`.`id` = `dialogs_users_dialogs_join`.`user_id` INNER JOIN `dialogs_users` ON `dialogs`.`id` = `dialogs_users`.`dialog_id` WHERE `dialogs_users`.`user_id` = 14 AND `users`.`id` = 15 LIMIT 1
SELECT  `users`.* FROM `users` INNER JOIN `dialogs_users` ON `users`.`id` = `dialogs_users`.`user_id` WHERE `dialogs_users`.`dialog_id` = 4 AND (`users`.`id` != 14)  ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `messages` WHERE `messages`.`dialog_id` = 3 AND `messages`.`user_id` = 15