app/controllers/home_controller.rb

SELECT  `articles`.* FROM `articles` WHERE (created_at < '2016-04-12 06:54:40.898457')  ORDER BY created_at DESC LIMIT 6
SELECT  `mypets`.* FROM `mypets` WHERE (pet_attachments_count > 0)  ORDER BY `mypets`.`id` DESC LIMIT 5
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `mypets` WHERE (pet_attachments_count > 0)
SELECT  `mypets`.* FROM `mypets` INNER JOIN `users` ON `mypets`.`user_id` = `users`.`id` WHERE `users`.`city_id` = 5 AND (pet_attachments_count > 0)  ORDER BY Rand() LIMIT 12
---
  def index
    @blogs = Blog.where("created_at < ?", Time.now).where(del: false).where("body_size > ?", 300).order("Rand()")
    @blogs = @blogs.joins(:blog_attachments).group('blogs.id').having("count(blog_attachments.id) > ?", 1).order('Rand()').limit(6)
    @articles = Article.where("created_at < ?", Time.now).order("created_at DESC").limit(6)
    @pet_day = Winner.last.user.mypets.where("pet_attachments_count > 0").sample if Winner.count > 1
    @pets = Mypet.where("pet_attachments_count > 0").order("Rand()").limit(12)
    if current_user && current_user.city
      @pets_city = current_user.city.mypets.where("pet_attachments_count > 0").order("Rand()").limit(12)