app/controllers/home_controller.rb

  def index
    @articles = Article.where("created_at < ?", Time.now).order("created_at DESC").limit(6)
    @pet_day = Winner.last.user.mypets.where("pet_attachments_count > 0").sample if Winner.count > 1
    @pets = Pet.where("pet_attachments_count > 0").includes(:pet_attachments).includes(:user).order("created_at DESC").limit(12)
    if current_user && current_user.city
      @pets_city = current_user.city.mypets.where("pet_attachments_count > 0").includes(:pet_attachments).includes(:user).order("created_at DESC").limit(12)
---
SELECT COUNT(*) FROM `pet_attachments` WHERE `pet_attachments`.`mypet_id` = 49