app/controllers/mypets_controller.rb

  def update_breeds
    @breeds = Breed.where("breed_type = ?", params[:breed_type])
---
SELECT `breeds`.* FROM `breeds` WHERE (breed_type = 'cat')