app/controllers/reviews_controller.rb

  def index
    @reviews = Review.order("created_at DESC")
---
SELECT `reviews`.* FROM `reviews`  ORDER BY created_at DESC

  def new
    @review = Review.new
    @breeds = Breed.where(breed_type:'dog')
---
SELECT `breeds`.* FROM `breeds` WHERE `breeds`.`breed_type` = 'dog'

  def breed_type
    if params[:breed_type] == 'dog'
      @reviews = Review.where(breed_type: 'dog')
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`breed_type` = 'Cat'  ORDER BY created_at DESC

  def show
    if @review = Review.find_by_id(params[:id])
      redirect_to review_show_path(@review.breed.breed_type, @review.breed.translate, @review) if params[:breed_translate] != @review.breed.translate || params[:breed_type] != @review.breed.breed_type
      @score = (@review.votes.sum(:score).to_f/@review.votes.count).round(1)
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 40 LIMIT 1
SELECT  `breeds`.* FROM `breeds` WHERE `breeds`.`translate` = 'ovcharka' LIMIT 1

  def edit
    if @review = Review.find_by_id(params[:id])
      if current_user && @review.user == current_user
        @breeds = Breed.where(breed_type: @review.breed.breed_type)
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 40 LIMIT 1
SELECT `breeds`.* FROM `breeds` WHERE `breeds`.`breed_type` = 'dog'

  def update
    @review = Review.find(params[:id])
    if @review.update(review_params.merge(breed_type: params[:breed_type]))
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 40 LIMIT 1
UPDATE `breeds` SET `reviews_count` = COALESCE(`reviews_count`, 0) - 1 WHERE `breeds`.`id` = 2
UPDATE `reviews` SET `breed_id` = 1, `breed_type` = 'dog', `updated_at` = '2016-04-12 06:54:49.005638' WHERE `reviews`.`id` = 40

  def image_create
    params[:review][:review_attachments].each do |file|
      @file = ReviewAttachment.create(file: file, user_id: current_user.id)
---
INSERT INTO `review_attachments` (`file`, `user_id`, `created_at`, `updated_at`) VALUES ('pic.jpg', 1, '2016-04-16 07:09:39.322187', '2016-04-16 07:09:39.322187')