app/controllers/subscribers_controller.rb

  def create
    # находим юзера на кого подписываемся
    @user = User.find_by_nickname(params[:user_id])
    # создаем для этого юзера подписчика current_user
    @user.subscribers.create(user: current_user)
    # создаем уведомление для @user о новом подписчике
    current_user.notices.create(user: @user)
    # проверка и создание награды для @user
    @user.subscribers.reload
    if @user.subscribers.count >= 1000
      @user.rewards.create(badge: Badge.find_by_slug('subscribers-platinum')) unless @user.rewards.where(badge: Badge.find_by_slug('subscribers-platinum')).present?
---
SELECT  `users`.* FROM `users` WHERE `users`.`nickname` = 'fdfdfdfd' LIMIT 1
INSERT INTO `subscribers` (`user_id`, `subscribable_id`, `subscribable_type`, `created_at`, `updated_at`) VALUES (14, 15, 'User', '2016-05-02 09:02:24.856704', '2016-05-02 09:02:24.856704')
INSERT INTO `notices` (`user_id`, `noticeable_id`, `noticeable_type`, `created_at`, `updated_at`) VALUES (15, 14, 'User', '2016-05-02 09:02:24.886003', '2016-05-02 09:02:24.886003')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `rewards` (`user_id`, `created_at`, `updated_at`) VALUES (15, '2016-05-02 09:07:49.043816', '2016-05-02 09:07:49.043816')
SELECT  `badges`.* FROM `badges` WHERE `badges`.`slug` = 'subscribers-bronze' LIMIT 1
SELECT `rewards`.* FROM `rewards` WHERE `rewards`.`user_id` = 15 AND `rewards`.`badge_id` IS NULL

  def destroy
    @user = User.find_by_nickname(params[:user_id])
    Subscriber.where(subscribable_type: 'User', subscribable_id: @user.id, user: current_user).delete_all
    current_user.notices.create(user: @user, add: false)
---
SELECT  `users`.* FROM `users` WHERE `users`.`nickname` = 'fdfdfdfd' LIMIT 1
DELETE FROM `subscribers` WHERE `subscribers`.`subscribable_type` = 'User' AND `subscribers`.`subscribable_id` = 15 AND `subscribers`.`user_id` = 14
SELECT `subscribers`.* FROM `subscribers` WHERE `subscribers`.`subscribable_id` = 15 AND `subscribers`.`subscribable_type` = 'User' AND `subscribers`.`subscribable_type` = 'User' AND `subscribers`.`subscribable_id` = 15 AND `subscribers`.`user_id` = 14
INSERT INTO `notices` (`user_id`, `add`, `noticeable_id`, `noticeable_type`, `created_at`, `updated_at`) VALUES (15, 0, 14, 'User', '2016-05-02 09:06:23.563022', '2016-05-02 09:06:23.563022')