app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`nickname` = 'admin' LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`user_id` = 1 AND (created_at < '2016-04-20 12:17:07.025299') AND `blogs`.`del` = 0  ORDER BY created_at DESC
---
  def show
    if @user = User.find_by_nickname(params[:id])
      @pets = @user.pets
      @blogs = @user.blogs.where("created_at < ?", Time.now).where(del: false).order('created_at DESC')

SELECT `countries`.* FROM `countries`
SELECT `cities`.* FROM `cities` WHERE `cities`.`country_id` = 3
SELECT  `countries`.* FROM `countries` WHERE `countries`.`id` = 3 LIMIT 1
---
  def edit
    if current_user
      @user = current_user
      if @user.country.nil?
        @countries = Country.all
        @cities = City.where("country_id = ?", 1)
      else
        @countries = Country.all
        @cities = @user.country.cities