app/views/reviews/_nav.html.erb

SELECT  `breeds`.* FROM `breeds` WHERE `breeds`.`translate` = 'ovcharka' LIMIT 1
---
<% if params[:action] == 'breed_translate' || params[:action] == 'show' %>
    -> <%= Breed.find_by_translate(params[:breed_translate]).name %>

SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 40 LIMIT 1
---
<% if params[:action] == 'show' %>
    -> Отзыв № <%= params[:id] %> от <%= Review.find(params[:id]).created_at.strftime("%d/%m/%Y") %>