app/views/reviews/edit.html.erb

SELECT  `breeds`.* FROM `breeds` WHERE `breeds`.`id` = 2 LIMIT 1
---
                <label class="field-new">
                  <%= f.select :breed_id, options_for_select(@breeds.collect { |breed| [breed.name.titleize, breed.id] }, @review.breed.id), {}, { id: 'breeds_select'} %>

SELECT `review_attachments`.* FROM `review_attachments` WHERE `review_attachments`.`review_id` = 40
---
          <ul class="post-pics">
            <% @review.review_attachments.each do |image| %>